In [167]:
import pandas as pd
us_wheather = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando'],
    'temperature': [23, 45, 38],
    'humidity': [34,78,56]
})

In [168]:
uae_wheather = pd.DataFrame({
    'city': ['dubai', 'Abu dhabi', 'Sharjah'],
    'temperature': [34,44, 55],
    'humidity': [67,77,99]
})

In [169]:
#concatinate two df, vertical mount
#ignore_index create squential index other wise it will be 0,1,2,0,1,2
pd.concat([us_wheather, uae_wheather], ignore_index=True)

        city  temperature  humidity
0   new york           23        34
1    chicago           45        78
2    orlando           38        56
3      dubai           34        67
4  Abu dhabi           44        77
5    Sharjah           55        99

In [170]:
#we can give key and later use them to get all data under that key
df = pd.concat([us_wheather, uae_wheather], keys=['usa', 'uae']) 
df

            city  temperature  humidity
usa 0   new york           23        34
    1    chicago           45        78
    2    orlando           38        56
uae 0      dubai           34        67
    1  Abu dhabi           44        77
    2    Sharjah           55        99

In [171]:
#we can give key and later use them to get all data under that key
df.loc['uae']

        city  temperature  humidity
0      dubai           34        67
1  Abu dhabi           44        77
2    Sharjah           55        99

In [172]:
cars_1 = pd.DataFrame({
    'carName': ['bugatti', 'lambo', 'Lexus'],
    'colour': ['red','green', 'yellow'],
}, index=[0,1,2]) #we use index to make the index same of both tables

cars_1

   carName  colour
0  bugatti     red
1    lambo   green
2    Lexus  yellow

In [173]:
cars_2 = pd.DataFrame({
    'carName': ['lambo', 'bugatti'],
    'convertible': [False, True]
}, index=[1,0]) #we use index to make the index same of both tables

cars_2

   carName  convertible
1    lambo        False
0  bugatti         True

In [174]:
pd.concat([cars_1, cars_2], axis = 1) #horizontal mount

   carName  colour  carName convertible
0  bugatti     red  bugatti        True
1    lambo   green    lambo       False
2    Lexus  yellow      NaN         NaN

In [175]:
df_1 = pd.DataFrame({
    'city': ['dubai', 'Abu dhabi', 'Sharjah'],
    'humidity': [67,77,99]
})

In [176]:
df_2 = pd.DataFrame({
    'city': ['dubai', 'Abu dhabi'],
    'temperature': [34,44],
})

In [177]:
#inner join - only gives both common fields (cities)
pd.merge(df_1, df_2, on='city')

        city  humidity  temperature
0      dubai        67           34
1  Abu dhabi        77           44

In [178]:
pd.merge(df_1, df_2, on='city')

        city  humidity  temperature
0      dubai        67           34
1  Abu dhabi        77           44

In [179]:
#left join - gives all fields on left then the common fields from right
pd.merge(df_1, df_2, on='city', how='left')

        city  humidity  temperature
0      dubai        67         34.0
1  Abu dhabi        77         44.0
2    Sharjah        99          NaN

In [180]:
#right join - gives all fields on right then the common fields from left
pd.merge(df_1, df_2, on='city', how='right')

        city  humidity  temperature
0      dubai        67           34
1  Abu dhabi        77           44

In [181]:
#outer join - gives all fields on right and left
pd.merge(df_1, df_2, on='city', how='outer')

        city  humidity  temperature
0  Abu dhabi        77         44.0
1    Sharjah        99          NaN
2      dubai        67         34.0